In [3]:
import numpy as np
import pandas as pd

In [5]:
#criando uma dataFrame com dados nulos - nan

#dicionario
d =  {'A': [1, 2, np.nan], 'B':[0, np.nan, np.nan], 'C':[1,2,3]}

#criando dataframe a partir do dicionario
dataf = pd.DataFrame(d)
dataf

     A    B  C
0  1.0  0.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
#Apagando valore NAN com DROPNA
#contra - apaga a linha inteira que possui um valor NULO = NAN

dataf.dropna()

     A    B  C
0  1.0  0.0  1

In [8]:
#Apagando valore NAN com DROPNA
#Metodo  - THRESH - apaga somente se encontrar uma quantidade X de valor NAN, quantidae estabelecida pelo programador

dataf.dropna(thresh = 2)

     A    B  C
0  1.0  0.0  1
1  2.0  NaN  2

In [9]:
#Substituindo valores com FILLNA

dataf.fillna(value = 'NULO')

      A     B  C
0     1     0  1
1     2  NULO  2
2  NULO  NULO  3

In [10]:
#Substituindo valores com FILLNA
#substituir valor NAN pela media da coluna

dataf['A'].fillna(value = dataf['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [11]:
#Substituindo valores com FILLNA
#Metodo = FFILL - repede o ultimo numero antes do valor NAN

dataf.fillna(method = 'ffill')

     A    B  C
0  1.0  0.0  1
1  2.0  0.0  2
2  2.0  0.0  3